## Terraform checks for 'prod'
### Terraform Plan 📖
Acquiring state lock. This may take a few moments...
module.iam.data.aws_iam_policy_document.default: Reading...
module.ecr.aws_ecr_repository.default: Refreshing state... [id=terraform-example-repository]
module.network.aws_vpc.default: Refreshing state... [id=vpc-0443047b5d813e8c9]
module.iam.data.aws_iam_policy_document.default: Read complete after 0s [id=320642683]
module.iam.aws_iam_role.default: Refreshing state... [id=terraform-example-role]
module.iam.aws_iam_role_policy_attachment.default: Refreshing state... [id=terraform-example-role-20240615112027836900000001]
module.ecr.null_resource.default: Refreshing state... [id=6759109604470007915]
module.network.aws_internet_gateway.default: Refreshing state... [id=igw-065e5fbd5e6f3d760]
module.network.aws_subnet.public_a: Refreshing state... [id=subnet-099d1857b529899aa]
module.network.aws_subnet.public_c: Refreshing state... [id=subnet-0f03c365595fe1507]
module.network.aws_route_table.public: Refreshing state... [id=rtb-0503b47a159c107b6]
module.network.aws_route_table_association.public_c: Refreshing state... [id=rtbassoc-04aea2e7ddeb9affb]
module.network.aws_route.public: Refreshing state... [id=r-rtb-0503b47a159c107b61080289494]
module.network.aws_route_table_association.public_a: Refreshing state... [id=rtbassoc-0c3e6a8d23606d78a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.sg.aws_security_group.default will be created
  + resource "aws_security_group" "default" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "terraform-example-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0443047b5d813e8c9"
    }

  # module.sg.aws_security_group_rule.egress_all_all will be created
  + resource "aws_security_group_rule" "egress_all_all" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.sg.aws_security_group_rule.ingress_sg_all will be created
  + resource "aws_security_group_rule" "ingress_sg_all" {
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
